<span style="color: #E5E4E4; font-family: Helvetica;">

### [Алгоритмы](README.md) / Динамическое программирование: Мячик на лестнице

# **Задача: Мячик на лестнице**

## **Условие:**

На вершине лесенки, содержащей *N* ступенек, находится мячик, который начинает прыгать по ним вниз, к основанию. Мячик может прыгнуть на следующую ступеньку, на ступеньку через одну или через 2. (То есть, если мячик лежит на 8-ой ступеньке, то он может переместиться на 5-ую, 6-ую или 7-ую.) Определить число всевозможных "маршрутов" мячика с вершины на землю.

### **Входные данные**

Вводится одно число 0 < N < 31.

### **Выходные данные**

Выведите одно число — количество маршрутов.

## **Разбор решения:**

Для начала нужно решить, как записать формулой варианты маршрута, если мячик стоит на неизвестной ступеньке *N* (буквально вывести формулу). Есть три варианта: мячик прыгает на ступеньку *N - 1*, где у него будет некое число вариантов дальнейшего маршрута, может прыгнуть на ступеньку *N - 2*, где также будет свое количество вариантов, или на ступеньку *N - 3*, где у мячика тоже будут различные варианты дальнейшего пути. То есть можно утверждать, что количество вариантов для ступеньки *N* – ничто иное как сумма чисел вариантов маршрута предыдущих ему ступенек, это можно записать формулой: 

*var(N) = var(N - 1) + var(N - 2) + var(N - 3)*
 
Выведенная формула очень похожа на формулу нахождения числа Фибоначчи. Если мы закроем глаза на лестницу и мячик, то мы поймем, что это, также как и ряд Фибоначчи, последовательность вариантов маршрута, в которой тоже есть закономерность.

Как и в прошлой задаче, составим таблицу:

|   *n*   | 1 | 2 | 3 | 4 | 5 | 6 | ... |
|---------|---|---|---|---|---|---|-----|
| решение | 1 | 2 | 4 | 7 | 13 | 24 | ... |

Общая логика решения идентична с решением последовательности Фибоначчи:

    memory = {1: 1, 2: 2, 3: 4}

    def var(n):
        if n in memory:
            return memory[n]
        else:
            memory[n] = var(n - 1) + var(n - 2) + var(n - 3)
            return memory[n]
        
Изменились только изначальные данные в словаре. Теперь мы добавили в таблицу три решения, потому что мы можем прыгать на три ступеньки вниз. Это обязывает нас рассмотреть решение для первых трех ступенек.

Если мячик стоит на первой ступеньке, то у него есть только один вариант – спрыгнуть вниз. Если мячик стоит на второй ступеньке, он может спрыгнуть на первую ступеньку, с которой можно спрыгнуть только одним способом, или сразу перепрыгнуть через ступеньку и спрыгнуть с лестницы – 2 варианта. Если же мячик стоит на третьей ступеньке, он может спрыгнуть либо на вторую, откуда можно спрыгнуть двумя вариантами, либо сразу на первую, либо перепрыгнуть через две и спрыгнуть с лестницы – 4 варианта.

Эта последовательность также проста, как и числа Фибоначчи, поэтому эту задачу несложно записать и без рекурсии.

    memory = [0 for _ in range(n)]
    memory[0], memory[1], memory[3] = 1, 2, 4

    for i in range(1, n):
        memory[i] = memory[i - 1] + memory[i - 2]
        
    print(memory[n - 1])

</span>